
from FIXTURE.fixture_application import Application
import pytest
import os.path
import json

#import importlib
#import jsonpickle

AppFixture = None  # Глобальная переменная - экземпляр фикстуры для запуска тестов
Parameters = None  # Глобальная переменная - экземпляр для хранения параметров считанных из конфиг файла "config.json"

#########################################################################################################################################################################################
#   Фикстура для подготовки к старту тестов:
#########################################################################################################################################################################################

@pytest.fixture
def app(request):

    #  1. Говорим что будем использовать глобальную переменную объявленную выше:
    global AppFixture

    # 2. Загружаем конфиг файл из корня проекта и читаем параметры секции web:
    web_config = load_config(request.config.getoption("--config"))['web']

    # 3. Если фикстура еще не существует или стала попорченой:
    if (AppFixture is None) or not AppFixture.is_valid():

        AppFixture = Application(browser =  web_config['browser'], base_url =  web_config['baseUrl'])

    # 4. Выполняем логин и создание сессии:
    AppFixture.session.Login_process(username=web_config['username'], password=web_config['password'])

    # Чуть позже заменим логин на этот:
    #AppFixture.session.Ensure_Login_process(username =  web_config['username'], password =  web_config['password'])

    return AppFixture

##########################################################################################################################################################################################
#   Фикстура для подготовки к завершению тестов:
##########################################################################################################################################################################################

@pytest.fixture( scope="session", autouse = True )
def stop(request):

    ####################################################################################################################
    # Функция завершающая работу после выполнения тестов
    ####################################################################################################################
    def fin():

        # 1. Выполняем логаут:
        AppFixture.session.Logout_process()  # Позже заменим на Ensure_Login c проверкой того, что мы еще залогинены:

        # 2. Выполняем уничтожение экземпляра фикстуры:
        AppFixture.Destroy()

    ####################################################################################################################

    # 1. Указываем что нужно вызвать при завершениии тестов.
    request.addfinalizer(fin)

    # 2. Возвращаем наверх экземпляр
    return AppFixture


##########################################################################################################################################################################################
#   Функция для загрузки параметров из конфигурационного файла
##########################################################################################################################################################################################

def load_config(file):

    # 1. Говорим что будем использовать глобальную переменную объявленную выше:
    global Parameters

    # 2. Если первый запуск и параметры еще не прочитали из конфиг файла, то надо прочитать:
    if Parameters is None:

        # 2.1 Формируем имя файла и путь для открытия файла с параметрами конфигурации:
        cfg_file = os.path.join(os.path.dirname(os.path.abspath(__file__)), file)                     # Путь + Имя файла

        # 2.1 Открываем файл и читаем все в переменную Parameters (закрывать не надо так как with все сам сделает!)
        with open(cfg_file) as config_file:
            Parameters = json.load(config_file)

    # 3. Возвращаем наверх считанные параметры
    return Parameters

##########################################################################################################################################################################################
#   Указываем параметр для конфигурации в файле: to register custom command-line arguments and configuration options.
##########################################################################################################################################################################################

def pytest_addoption(parser):
    parser.addoption("--config", action="store", default="config.json" )